# Series in Pandas

In [36]:
import pandas as pd

In [37]:
lit = [1,2,3,"Azeem"]

In [38]:
ser = pd.Series(lit)
print(ser)

0        1
1        2
2        3
3    Azeem
dtype: object

In [39]:
ser[0]

1

In [40]:
ser[2]

3

In [41]:
ser[0:3]

0    1
1    2
2    3
dtype: object

In [42]:
type(ser)

pandas.core.series.Series

In [43]:
ser1 = pd.Series(lit)
print(ser1)

0        1
1        2
2        3
3    Azeem
dtype: object

In [44]:
ser + ser1

0             2
1             4
2             6
3    AzeemAzeem
dtype: object

In [45]:
ser2 = pd.Series(lit, index = ['a','b','c','d'])
print(ser2)

a        1
b        2
c        3
d    Azeem
dtype: object

In [46]:
ser + ser2

0    NaN
1    NaN
2    NaN
3    NaN
a    NaN
b    NaN
c    NaN
d    NaN
dtype: object

In [47]:
ser3 = pd.Series(['1','2','3','4'], index = ['a','b','c','d'], dtype = float)
print(ser3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [48]:
dect_s = pd.Series({'a':1,'b':2})
dect_s

a    1
b    2
dtype: int64

In [49]:
max(ser3)

4.0

In [50]:
min(ser3)

1.0

# DataFrame

In [53]:
emp_df = pd.DataFrame([1,2,3])
emp_df

   0
0  1
1  2
2  3

In [55]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
dec = {"ID":[1,2,3,4]}
dec

{'ID': [1, 2, 3, 4]}

In [57]:
pd.DataFrame(dec)

   ID
0   1
1   2
2   3
3   4

In [60]:
dec1 = {"ID":pd.Series([1,2,3,4])}
dec1

{'ID': 0    1
 1    2
 2    3
 3    4
 dtype: int64}

In [61]:
pd.DataFrame(dec1)

   ID
0   1
1   2
2   3
3   4